/**
 * 关于 typescript
 *      typescript 是微软2012年10月开发的一个开源的编程语言，当前版本为 4.8.4 。
 *      typescript 是 JavaScript 的超集，扩展了 JavaScript，为它添加了类型支持，来源于JavaScript，归于JavaScript。
 *      typescript 通过 typescript 编译器 或 babel 转译成 JavaScript 代码。
 *      typescript 可以编译出普通、干净、完整的 JavaScript 代码。
 *      可运行任何浏览器，任何操作系统，任何可运行JavaScript的地方。
 *
 * 为什么要用 typescript
 *      现在不会用 typescript 的程序员不是一个合格的前端，前端程序员也要有类型的思维。
 *      1. 静态写入
 *          静态类型化是一种功能，可以在开发人员编写脚本的时候检测错误。查找并修复错误是当今开发团队的迫切需求。
 *          有了这项功能，就会允许开发人员编写更健壮的代码并对其进行维护，以便使得代码质量更好、更清晰。
 *      2.大型的开发项目
 *          有时为了改进开发项目，需要对代码库进行小的增量更改。这些小小的变化可能会产生严重的、意想不到的后果，因此有必要撤销这些变化。
 *          使用 typescript 来重构变更更容易、更方便。
 *      3.更好的协作
 *          当开发大型项目时，会有许多的开发人员，此时乱码和错误的机会也会增加。类型安全是一种在编码期间检测错误的功能，而不是在编译项目时检测错误。
 *          这为开发团队创建了一个更好的编码和调试过程。
 *      4.更强的生产力
 *          干净的 ecmascript6 代码，自动完成和动态输入等因素有助于提高开发人员的工作效率。这些功能也有助于编译器创建优化的代码。
 * */
function demo01() {
    
}